Revit 2024 API
DividedPath.IsValidBeginningIndent Method
 Checks that the indent value does not cause the beginningIndent and endIndent to overlop
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool IsValidBeginningIndent(
	double beginningIndent
)
Visual Basic
Public Function IsValidBeginningIndent ( _
	beginningIndent As Double _
) As Boolean
Visual C++
public:
bool IsValidBeginningIndent(
	double beginningIndent
)
Parameters
beginningIndent
Type: System.Double
See Also
DividedPath Class
Autodesk.Revit.DB Namespace